{
  "research_work": [
    {
      "title": "Perception of cervical abrasion among adult Nigerians",
      "authors": "Eriamiatoe Efe BDS",
      "publicationDate": "2021-11-09",
      "abstract": "ABSTRACT: <br>This cross-sectional survey aimed to understand the perception of tooth abrasion among adult Nigerians. The study included five groups, with varying degrees of tooth abrasion and a control group. The results highlighted a lack of knowledge about tooth abrasion among the respondents, with many unable to correctly identify the condition. Respondents believed that tooth abrasion was common, particularly in older individuals, and often associated it with lower socio-economic status and a lack of formal education. Regarding the causes of tooth abrasion, the majority attributed it to incorrect brushing methods. Respondents believed that prevention was possible, mainly through the use of soft toothbrushes and proper dental check-ups. Attitudes towards individuals with tooth abrasion varied slightly between the study groups, with group A appearing the most negative, especially in terms of considering these individuals aggressive and being less likely to date them. On the other hand, group B was more likely to consider these individuals as friendly. Overall, there was a slightly negative perception among those with severe forms of the condition, but the differences were not substantial. When assessing employer perceptions, the study found that group A was most unlikely to employ individuals with tooth abrasion, but there was no difference in attitudes towards firing employees based on the condition. Employer decisions regarding promotions were not negatively influenced by tooth abrasion. In general, the discriminatory attitudes towards individuals with tooth abrasion were low among respondents, with few significant differences between the control group and the study groups. This suggests that individuals with tooth abrasion do not face substantial discrimination. In conclusion, the study reveals a lack of knowledge about tooth abrasion, with some negative perceptions and variations in attitudes between different study groups. However, discriminatory attitudes were generally low, indicating the need for increased awareness and education about this dental condition..",
      "link": "Perception.pdf"
    }
 
    
  ]
}
